---@type ChadrcConfig
local M = {}

M.base46 = {
  theme = "solarized_osaka",
  transparency = true,
}

-- lua/chadrc.lua
M.nvdash = {
  load_on_startup = true,
    header = {
    "",
    "   ▐ ▄ ▄▄▄ .       ▌ ▐·▪  • ▌ ▄ ·.   ",
    "   •█▌▐█▀▄.▀· ▄█▀▄ ▪█·█▌██ ·██ ▐███▪ ",
    "   ▐█▐▐▌▐▀▀▪▄▐█▌.▐▌▐█▐█•▐█·▐█ ▌▐▌▐█· ",
    "   ██▐█▌▐█▄▄▌▐█▌.▐▌ ███ ▐█▌██ ██▌▐█▌ ",
    "   ▀▀ █▪ ▀▀▀  ▀█▄▀▪. ▀  ▀▀▀▀▀  █▪▀▀▀ ",
    "",
    "          (ノಠ益ಠ)ノ彡 Sɔɐɯǝ         ",
    "",
    },
  }

M.ui = {
statusline = {
    enabled = false, -- This kills the default Chadline
  },

}

return M
